menu = '''\nВыберите действие:
    1. Добавить заметку
    2. Удалить заметку
    3. Редактировать заметку
    4. Просмотреть заметки
    5. Сохранить заметки в файл
    6. Отобразить список файлов
    7. Открыть базу заметок из файла
    8. Выход\n'''

choice = 'Выбор пункта меню: '

file_name = 'Введите название файла заметок (NotesDatabase): '

file_not_found = 'Файл не найден'

file_added_successfully = 'Файл успешно добавлен в общие заметки '

file_list = 'Список файлов: '

input_id = 'Введите id заметки: '

input_title = 'Введите заголовок заметки: '

input_text = 'Введите текст заметки: '

confirm_delete = 'Вы действительно хотите удалить заметку? (y/n): '

incorrect_input = 'Некорректный ввод'

deletion_canceled = 'Удаление заметки отменено'

new_values = 'Введите новые значения (Enter, чтобы оставить прежние): '

save_to_file = 'Сохранение заметок в файл: '

file_ext = 'Введите расширение файла (csv): '

successfully_saved = 'Заметки успешно сохранены в файл.'

note_deleted = 'Заметка удалена: '

note_not_found = 'Заметка не найдена'

note_edited = 'Заметка отредактирована: '

unsupported_file_format = 'Неподдерживаемый формат файла: '

all_list = 'Список всех заметок: '

empty_list = 'Список заметок пуст'

note_created = 'Заметка создана: '

exception_in = 'Ошибка создания экземпляра класса Notes'
